app/controllers/todolists_controller.rb

  def show
  	# 詳細ページで呼び出される投稿データは、URLの/todolist/:id内の:idで判別
  	# レコード1件を取得するので、変数名は単数形の「@list」にします
  	@list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
  	@list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		# ストロングパラメーターを使用(Web上から入力されてきた値を制限)
		# インスタンス変数 = クラス名.newメソッド（引数）
		# @の付いていないローカルのインスタンス変数はviewファイルへ受け渡せない
		list = List.new(list_params) # パラメーターの略
		# DBへ保存する(送り先は上記で作ったやつ)
		list.save # データベースに保存をするためのメソッド
---
INSERT INTO "lists" ("title", "body", "created_at", "updated_at", "image_id") VALUES (?, ?, ?, ?, ?)

	def update
		# find(引数?)でidよりDBから該当データを抽出
		list = List.find(params[:id])
		list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "rails "], ["body", "カリキュラムが難しい"], ["updated_at", "2020-02-09 10:17:10.299948"], ["id", 1]]

	def destroy
		list = List.find(params[:id]) # データ(レコード)を1件取得
		list.destroy # データ（レコード）を削除
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 3]]